backup_system/backup_launcher/scripts/network/h3c/setStaticNAT.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <auth:Authentication env:mustUnderstand="1" xmlns:auth="http://www.h3c.com/netconf/base:1.0">
      <auth:AuthInfo>%authinfo%</auth:AuthInfo>
    </auth:Authentication>
  </env:Header>
  <env:Body>
	<rpc message-id ="101" xmlns="urn:ietf:params:xml:ns:netconf:base:1.0" xmlns:xc="urn:ietf:params:xml:ns:netconf:base:1.0">
		  <edit-config>
		    <target>
		      <running/>
		    </target>
		    <config>
		     <top xmlns="http://www.h3c.com/netconf/config:1.0">
   			 <NAT>
		  <OutboundStaticMappings>
		    <Mapping>
		      <LocalInfo>
		        <LocalVRF></LocalVRF>
		        <StartIpv4Address>%insideIp%</StartIpv4Address> 
		        <EndIpv4Address>%insideIp%</EndIpv4Address>
		      </LocalInfo>
		      <GlobalInfo>
		        <GlobalVRF></GlobalVRF>
		        <Ipv4Address>%globalIp%</Ipv4Address>
		        <Ipv4PrefixLength>32</Ipv4PrefixLength>
		      </GlobalInfo>
		    </Mapping>
		  </OutboundStaticMappings>
		</NAT>
   			</top>
		    </config>
		  </edit-config>
		</rpc>
  </env:Body>
</env:Envelope>
